"use strict";
//     მასივში წერია ნოვატორის აქციების წინა რამდენიმე დღის ისტორია.
//     ფუნქციის დანიშნულებაა იპოვოს რომელ დღეს უნდა გეყიდათ და რომელ დღეს გაგეყიდათ აქცია რომ მიგეღოთ მაქსიმალური მოგება.
//     ფუნქციამ უნდა დააბრუნოს მაქსიმალური შესაძლებელი მოგება.
function maxProfit(array) {
    let minPrice = array[0]; // ვინახავ ყველაზე დაბალ ციფრს; ანუ როცა ვყიდულობ აქციას;
    let maxProfit = 0; // ინახება ყველაზე მაღალი ციფრი, ანუ როდის ვყიდი აქციას
    // გადავირბინოთ ციკლით და გავიგოთ მასივში რომელია
    //ყველაზე დაბალი ციფრი და ყველაზე მაღალი
    for (let i = 1; i < array.length; i++) {
        // თუ არეის ელემენტი ნაკლებია მინიმანულფასზე ეს ციფრი შეინახე ამ ცვლადში
        if (array[i] < minPrice) {
            minPrice = array[i];
        }
        //profit - შევინახავ ციფრს რომელსაც მივიღებ ერეის ელემენტს ვაკლებ აწ უკვე  ნაპოვნ დაბალ ციფრს , როდესაც ვიყიდე აქცია
        let profit = array[i] - minPrice;
        // თუ მიღებული სხვაობა მეტია მახსიმალურ რიცხვზე ვინახავ ცვლადში
        if (profit > maxProfit) {
            maxProfit = profit;
        }
    }
    return maxProfit;
}
console.log(maxProfit([2, 1, 3, 3, 8, 2])); // 1; 8; 8 -  1 = 7
