// ასაკობრივი ჯგუფები
// ვებსაიტის თითოეულ მომხმარებელზე გვაქვს შემდეგი ცვლადი:

const age = 1;


// თქვენი დავალებაა ვებ-გვერდის მომხმარებლები ჩასვათ შესაბამის ასაკობრივ ჯგუფებში:

// 0-2: ჩვილი
// 3-12: ბავშვი
// 13-19: თინეიჯერი
// 20-65: ზრდასრული
// 65-ზე მაღლა: ხანდაზმული
// გამოთვალეთ შედეგი და ჩაწერეთ კატეგორიის სახელწოდება string ცვლადში:

let category;

if (age <= 2) {
    category = "ჩვილი";
} else if (age >= 3 && age <= 12) {
    category = "ბავშვი";
} else if (age >= 13 && age <= 19) {
    category = "თინეიჯერი";
} else if (age >= 20 && age <= 65) {
    category = "ზრდასრული";
} else if (age > 65) {
    category = "ხანდაზმული";
}
