// ჩექფოინთი
// მოცემული გვაქვს ცვლადები:

const checkpoints = [10, 20, 50, 60, 100];
const finish = 100;

// ვართ თამაშში, სადაც გმირი გადაადგილდება 0-კმ დან finish-კმ მდე. ეს ქმედება აღწერეთ for ლუპში.
// თითოეულ ჩექფოინთზე მიღწევისას ეკრანზე გამოიტანეთ (დალოგეთ):

"გილოცავთ, თქვენ გაიარეთ x კილომეტრიანი ჩექფოინთი"
// თამაშის ბოლოს კი დალოგეთ:
"გილოცავთ, თქვენ გადაკვეთეთ finish კილომეტრიანი ფინიშის ხაზი"
// P.S. შეგიძლიათ ივარაუდოთ რომ checkpoint-ების რაოდენობა სულ იქნება 4.



// 1. ჩემი მონაცემები არის  10, 20, 50, 60; 
// 2. უნდა გამოვთვალო ყოველი გათვლილი კილომეტრი და გამოვიტანო შესაბამისი მესჯი. 
// 3 . დავიწყოთ ფორ ლუპი და ჩმაოვუაროთ მასივს 
// 4. სანამ მოთამაშე ნაკლები იქნება 100  ზე და გა გაივლის გარკვეულ კილომეტრს , უნდა დაილოგოს შესაბამისი მესიჯი. 

for (let i = 0; i <= checkpoints.length; i++) { 
    if (i < checkpoints.length) {
        console.log(`გილოცავთ, თქვენ გაიარეთ ${checkpoints[i]} კილომეტრიანი ჩექფოინთი`);
    } else {
        console.log(`გილოცავთ, თქვენ გადაკვეთეთ ${finish} კილომეტრიანი ფინიშის ხაზი`);
    }
}
