"use strict";
// უნდა  შევქმნა ფუნქცია რომელიც არგუმენტად მიიღებს ციფრს ,
// ხოლო ფუნქციამ შეყვანილი ციფრის მიხედვით უნდა დამიბრუნოს
// ექსელის სვეტის მნიშვნელობა სტრინგის სახით.
// num = 1 აბრუნებთ A-ს
// num = 2 აბრუნებთ B-ს
// num = 3 აბრუნებთ C-ს
// num = 26 აბრუნებთ Z-ს
// num = 27 აბრუნებთ AA-ს
// num = 28 აბრუნებთ AB-ს
// ანუ ნებისმიერი მთელი რიცხვი უნდა გადავიყვანო მის შესაბამის სტრინგზე :
// 1 -  A; 2- B; 3 -  C ; 27  -  AB  და ასე შემდეგ.
function columnNumber(num) {
    let ordA = 'A'.charCodeAt(0); // A  გადამყვას რიცხვით მნიშვნელობაში -  1
    let ordZ = 'Z'.charCodeAt(0); //  Z - გადამყავს რიცხვით მნიშვნელობაში 26
    let len = ordZ - ordA + 1; // 26 - 1 =  25 + 1  =  26;
    // console.log(len) //  26
    let isString = ""; //  აქ უნდა შევინახო ჩემი დაბრუნებული რიცხვი სტრინგათ;
    while (num > 0) {
        num--; //ვაკლებ 1-ს, რომ A დაიწყოს ათვლა  0-დან
        isString = String.fromCharCode((num % len) + ordA) + isString;
        // გავარკვიე მიღებული რიცხვის ნაშთი რომელ ადგილზე დგას 26 სიმბოლოში
        // და შეევინახე სტრინგში ოღონდ წინ
        num = Math.floor(num / len);
        // მიდინარე რიცხვს ვყოფ 26 ზე და
        // შემდგომ ვამრგვალებ რომ გადავიდეს სტრინგში როგროც სიმბოლო
    }
    return isString;
}
console.log(columnNumber(30));
