// ჩამოსაგდები აპარატი
// მომხმარებელმა ჩამოსაგდები აპარატიდან შეიძინა გაზიანი სასმელი.


// ამ მაგალითის მიხედვით აპარატში არის 590 ცალი 50 თეთრიანი, 10 ცალი 1 ლარიანი, 20 ცალი 2 ლარიანი და ა.შ.
// ვთქვათ მომხმარებელმა შეაცურა 5 ლარიანი კუპიურა და ყიდულობს 1.50 იან პროდუქტს.
// ამ შემთხვევაში აპარატმა უნდა დააბრუნოს:

// 1. 1 ცალი 2 ლარიანი
// 2. 1 ცალი 1 ლარიანი
// 3. 1 ცალი 50 თეთრიანი

// რადგან ჩვენ გვსურს რაც შეილება მაღალი კუპიურები დავუბრუნოთ მომხმარებელს.
//  დავალებაა წაიკითხოთ bills ობიექტების მასივიდან მოაკლოთ ის კუპიურები, რაც მომხმარებელს უნდა დაუბრუნდეს.

// ამისათვის მან კუპიურა შეაცურა აპარატში:
const incomingBill = 50;

// ხოლო შეძენილი პროდუქტის ღირებულება იყო:
const productPrice = 5;

// აპარატში ხელმისაწვდომი კუპიურების რაოდენობა კი წერია ობიექტების მასივში:
const bills = [ 
    { lari: 0.50, quantity: 590 }, 
    { lari: 1, quantity: 10 }, 
    { lari: 2, quantity: 20 }, 
    { lari: 5, quantity: 30 }, 
    { lari: 10, quantity: 35 } 
];

// 1.  ფუნქციას სახელად dropCash() -  რომელსაც გადავცემ   პარამეტრს :  bills
// 2.  change -  ში ვინახავ  იმას თუ რა თანხა უნდა დავუბრუნოთ მომხმარებელს. 
// 3. ფორ ციკლით გადავირბენ bills -  ზე და მივწვდები ობიექტს. 

console.log(bills);



function dropCash(bills) {
    let change =  incomingBill - productPrice;

    for (let i = bills.length - 1; i >= 0; i--) {
        // console.log(bills[i]);
        if(change >=  bills[i].lari){
            change -= bills[i].lari; 
            bills[i].quantity--
            i++
        }
        if(change == 0) break
       console.log(change);
       
    }
   return change

}
console.log(dropCash(bills));
console.log(bills);


  
 
 
 
 
 