// სადაც ფუნქცია პირველ არგუმენტად მიიღებს რიცხვს.
// ხოლო ფუნქციამ უნდა დააბრუნოს ფიბონაჩის რიცხვებიდან რიგით n რიცხვი.
// ფიბონაჩის რიცხვების შესახებ მეტი ინფორმაციისთვის გაეცანით ამ ლინკს: https://en.wikipedia.org/wiki/Fibonacci_sequence
// მაგალითად, თუ n უდრის 10-ს, ფუნქციამ უნდა დააბრუნოს 55.
// P.S. გაითვალისწინეთ რომ ფიბონაჩის რიცხვების ითვლიან 0 ინდექსიდან, ანუ მეათე რიცხვი 55, რეალურად არის რიგით მეთერთმეტე.


function fib(n){
    const fi = [0, 1];
    for(let i = 2; i <= n; i ++){
        fi[i] = fi[i - 1] + fi[i - 2]

    }
    return fi[n]

}

console.log(fib(10));


