const size = 5;


// სადაც წერია პირამიდის სიმაღლე.
// თქვენი ამოცანაა console-ით დახატოთ #-ების პირამიდა.

// n = 5-ის მაგალითი:
// #
// ##
// ###
// ####
// #####
// 🔹 ახლა უნდა ვიფიქროთ, როგორ გამოვიტანოთ # სწორად:
// 1️⃣ პირველ იტერაციაზე (i = 0) უნდა დაიბეჭდოს 1 #
// 2️⃣ მეორეზე (i = 1) უნდა დაიბეჭდოს 2 #
// 3️⃣ მესამეზე (i = 2) უნდა დაიბეჭდოს 3 #
// 4️⃣ და ასე შემდეგ, სანამ size არ მივაღწევთ.
let simbol = '';  

for (let i = 0; i < size; i++) {
    simbol += '#';  
    console.log(simbol);  
}