// Online Shop
// მომხმარებელს ვებსაიტზე სურს პროდუქციის შეძენა, მოცემული გვაქვს შემდეგი ცვლადები:

const userBalance = 15;
const cartTotal = 10;


// მოხმმარებელმა დააჭირა ყიდვის ღილაკს.

// გამოთვალეთ მოხდა თუ არა წარმატებით გადახდა და ეკრანზე გამოიტანეთ (დალოგეთ) შესაბამისი ტექსტი:



// “გადახდა წარმატებით შესრულდა” ან “თქვენ არ გაქვთ საკმარისი თანხა”


if(userBalance >= cartTotal){
    console.log('გადახდა წარმატებით შესრულდა');
}else{
    console.log('თქვენ არ გაქვთ საკმარისი თანხა');
}


userBalance >= cartTotal ?  'წარმატებით განხორციელდა გადახდა' : 'თქვენ არ გაქვთ საკმარისი თანხა'