
// შექმენით ფუნქცია რომელსაც არგუმენტად გადმოეცემა სტრინგი:
// ეს სტრინგი შედგება მხოლოდ შემდეგი სიმბოლოებისაგან: '(', ')', '{', '}', '[', ']'.
// თქვენი ამოცანაა დაადგინოთ არის თუ არა ეს სტრინგი სწორად შედგენილი.
// სტრინგი სწორია თუ ის ემთქვევა HTML ტეგების ნესტინგის წესებს, 
// ანუ ფრჩხილების გახსნა-დახურვა სწორი თანმიმდევრობით ხდება.
// ანუ მაგალითად:
// სტრინგი '({(]))' არასწორია.
// სტრინგი '({})' სწორია.



// შეამოწმეთ სტრინგი და პასუხი ფუნქციიდან დააბრუნეთ boolean ტიპში.





                //  push - დაამატებს პირველ ელემენტს
                //  pop -  ამოშლის ბოლო ემენტს 

                //   შევქმნი ახალ ცვლად რომელიც იქნება ცარიელი მაივი რათა შევინახო ჩემი სიმბოლოები
                //   for -  ით გადავირბინო სტრინგზე
                //    თუ სიმბოლო ღია ფრჩხილია (, {, [, მაშინ მას  ჩავწერ მასივის თავში  
                //    თუ სიმბოლო დახურული ფრჩხილია ), }, ], მაშინ:
                //    	 მასივიდან  ვიღებთ ბოლო ელემენტს და ვამოწმებთ, ემთხვევა თუ არა შესაბამის  სიმბოლოს 
                         
                //    	       

const string = '';

function checkNest(string) {
    // შევქმენი ცარიელი მასივი სადაც შევინახავ თითოეულ ამოებილ სიმბოლოს
    let emptyArray = [];

    // დავატრიალე ციკლი და გადავირბინე სტინგზე. 
    for(let i = 0; i < string.length;  i ++){
        let str = emptyArray[emptyArray.length -  1];
        //  აქ იფს ვეუბნები თუ გადმოცემული სტრინგი შეციცავს : გახსნის ფრჩხილს  ან  გახსნის ფიგურულ ან  ოთხკუთხედს 
        // მაშინ ესენი დააამატე emptyArray -  მასივში
        if(string[i] == '(' || string[i] == '{' || string[i] == '['){
            emptyArray.push(string[i])
           // აქ ვიწყებ შემოწმებას თუ str -  არსებული '(' და string[i] შეყვანილი ')' 
           // ერთნაირი ჩაწერე მარცხენა მხარეს, და მივწყვები ყევლა სიმბოლოზე 
        } else if((str == '(' && string[i] == ')') || (str == '{' && string[i] == '}')  || (str == '[' && string[i] == ']')){
            emptyArray.pop()
        }else return false      // სხვა შემთხვევაში დამიბრუნე ფალსი 
    }

    // საბოლოდ ვამოწმებ ჩემს საბოლო მასივში ყველა სიმბოლო დაიხურა თუ არა. 

    if (emptyArray.length) {
        return false;
    } else {
        return true;
    }
}
 
 console.log(checkNest('([)]'));
 


 
 
