// YouTube კომენტარები
// პროგრამაში რომელიც იუთუბის კომენტარებს აკონტროლებს, მოცემული გვაქვს ორი ცვლადი:

const userIsLoggedIn = true;
const videoIsCommentable = true;


// იმისათვის რომ მომხმარებელმა შეძლოს ვიდეოზე დაკომენტარება, საჭიროა ის იყოს ავტორიზებული.

// ასევე, საჭიროა რომ ვიდეოს ავტორს ჩართული ქონდეს ვიდეოზე დაკომენტარების ფუნქცია.



// გამოიანგარიშეთ შედეგი და ჩაწერეთ boolean ცვლადში:
// userCanComment = მომხმარებელი უნდა იყოს შესული  პროფილზე  და საჭიროა რომ ვიდეოზე იყოს დაკომენტარების ფუნქცია; 

let userCanComment  =  userIsLoggedIn && videoIsCommentable;
console.log(userCanComment);
