// სტუდენტი გამოცდაზე
// სტუდენტმა წერა გამოცდა და მიიღო ქულა, რომელსაც ვინახავთ ცვლადში:

const testScore = 40;


// სტუდენტს აქვს რამდენიმე შანსი:

// თუ მან გადალახა 95 ქულიანი ზღვარი, მიულოცეთ (დალოგეთ) მას ტექსტით "გილოცავთ, თქვენ ჩაირიცხეთ ნოვატორში"
// თუ მან გადალახა 70 ქულიანი ზღვარი, მიულოცეთ (დალოგეთ) მას ტექსტით "გილოცავთ, თქვენ ჩაირიცხეთ კემბრიჯში"
// თუ მან გადალახა 50 ქულიანი ზღვარი, მიულოცეთ (დალოგეთ) მას ტექსტით "გილოცავთ, თქვენ ჩაირიცხეთ რენდომ უნივერსიტეტში"
// თუ მან ვერ გადალახა ზღვარი, დალოგეთ "ჩაჭრილები ნანახი გაქვს?"


if (testScore >= 95){
    console.log('გილოცავთ, თქვენ ჩაირიცხეთ ნოვატორში');
}else if(testScore >= 70){
    console.log('გილოცავთ, თქვენ ჩაირიცხეთ კემბრიჯში');
}else if (testScore >=  50){
    console.log('გილოცავთ, თქვენ ჩაირიცხეთ რენდომ უნივერსიტეტში');
}else{
    console.log('ჩაჭრილები ნანახი გაქვს?')
}
