// ეროვნულები
// გიგომ ეროვნულ გამოცდებზე გაილაშქრა. მოცემული გვაქვს შემდეგი ცვლადი:

const gigosResults = [30, 25, 40]; // გიგოს მიერ ჩაბარებული გამოცდების ქულები.
const  barrier = 25; 
let  gigoFailed =  false;


// მასივში შეიძლბა ეწეროს 1-დან 4-ის ჩათვლით ნებისმიერი რაოდენობის გამოცდის ქულა. 
// რადგან შეიძლება გიგოს ჯერ არ უწერია ყველა გამოცდა.
// ეროვნულებზე ყველა საგანში გამსვლელი ქულა შეუცვლიათ და არის 25.

// შეამოწმეთ, გიგო ხომ არ ჩაიჭრა და შედეგი ტექსტური მესიჯის სახით გამოიტანეთ ეკრანზე:

// "გილოცავთ გიგო, შენ წარმატებით გაიარე გამოცდა" - თუ ოთხივე გამოცდაში გადალახა ბარიერი
// "ჯერჯერობით გიგო ხოდზეა" - თუ ჯერჯერობით არცერთ გამოცდაში არ ჩაჭრილა
// "გიგო ჩაიჭრა რომელიღაც გამოცდაში" - თუ რომელიმე გამოცდაში მაინც ჩაიჭრა

 
 
if(gigosResults.length >= 1 && gigosResults[0] < barrier){
    gigoFailed =  true
}else if(gigosResults.length >= 2 && gigosResults[1] < barrier){
    gigoFailed = true
}else if(gigosResults.length >= 4 && gigosResults[2] <  barrier){
    gigoFailed =  true
}else if(gigosResults.length >= 4 && gigosResults[3] < barrier){
    gigoFailed =  true
}

if (gigoFailed) {
    console.log("გიგო ჩაიჭრა რომელიღაც გამოცდაში");
} else if (gigosResults.length === 4) {
    console.log("გილოცავთ გიგო, შენ წარმატებით გაიარე გამოცდა");
} else {
    console.log("ჯერჯერობით გიგო ხოდზეა");
}




// ნაბიჯი 1: 
//         ჩემი მონაცემებია  30, 21 40; 
// ნაბიჯი 2: 
//         გამოვთვალო გადალახა თუ არა გიგომ  ბარიერი 
// ნაბიჯი 3 : 
//        თუ გიგომ ბარიერი გადალახა 4 გამოცდაში
//        თუ გიგო არ ჩაჭრილა არცეთ გამოცდაში 
//        თუ გიგიო ჩაიჭრა


