// ონლაინ მაღაზია
// მომხმარებელს ვებსაიტზე სურს პროდუქციის შეძენა, მოცემული გვაქვს შემდეგი ცვლადები:

const userBalance = 5; // მომხმარებლის ბალანსი 
const cartTotal = 20; // მომხმარებლის მიერ არჩეული პროდუქციის ჯამი 
let  enoughMoney =  userBalance >= cartTotal;   //  ადარებს  ბალანს და კალათას ერთმანეთს
let difference =  userBalance < cartTotal ? cartTotal  - userBalance : 0// ისთვლის სხვაობას 

// მოხმმარებელმა დააჭირა ყიდვის ღილაკს. გამოთვალეთ 
// მოხდა თუ არა წარმატებით გადახდა და ეკრანზე გამოიტანეთ შესაბამისი ტექსტი:

// "გადახდა წარმატებით შესრულდა"
// ან
// "თქვენ არ გაქვთ საკმარისი თანხა, გთხოვთ დამატებით ჩარიცხოთ x ლარი ოპერაციის დასასრულებლად"

// (სადაც x იქნება ის რიცხვი, რამდენი ლარიც აკლია მომხმარებელს ნივთების შესაძენად)

// ნაბიჯი 1 : 
//          ჩემი ბალანსი შეასდენს 50 
//          კალათაში მაქვს 20;
// ნაბიჯი 2 :
//        გამოვთვალო ავქს თუ არა  მომხამრებელს საკმარისი თანხა ბალანსზე და შევასდარო კალათას
//        გამოვთვალო ბალანსზე ნაკლები თანხის და კალათაში მეტი თანხის არსებობსი შემთხბვაში რამდენია სხვაობა 
// ნაბიჯი 3 : 
//        თუ მომხამრებლის ბალანსი და კალათის ღირებულება ტოლია მაშინ გამოიტანოს რომ "გადახდა წარმატებით შესრულდა"
//        თუ მომხმარებელს არ აქვს საკმარისი თანხა ბალანზე "თქვენ არ გაქვთ საკმარისი თანხა, გთხოვთ დამატებით 
//        ჩარიცხოთ x ლარი ოპერაციის დასასრულებლად"
if(enoughMoney){
    console.log('გადახდა წარმატებით შესრულდა');
}else{
    console.log(`თქვენ არ გაქვთ საკმარისი თანხა, გთხოვთ დამატებით ჩარიცხოთ ${difference} ლარი ოპერაციის დასასრულებლად`);
    
}