// კორექტული მისალმება
// პოლიტკორექტული მისალმება-დამშვიდობების მექანიზმი
// ვებსაიტზე მოცემული გვაქვს შემდეგი ცვლადები:
const userLoggedIn = true;
const userFirstName = 'გოგი';
const userIsFemale = false;
// თუ მომხმარებელი არ არის ავტორიზებული, მაშინ მას უნდა დავემშვიდობოთ (დავლოგოთ),
// ხოლო თუ ავტორიზებულია, მაშინ უნდა მივესალმოთ (დავლოგოთ).
// მაგალითად:
// "სალამი ქალბატონო ქეთევან"
// ან
// "სალამი ბატონო გიორგი"
// ან
// "დროებით ბატონო მიშა"
// ან
// "დროებით ქალბატონო ნინო"

// P.S. საუკეთესო შედეგისთვის ეს ამოცანა უნდა ამოხსნათ 1 template literal-ის გამოყენებით.

// if(userLoggedIn){
//     if(userIsFemale){
//         console.log(`მოგესალმებით ქალბატონო ${userFirstName}`);
//     }else{
//         console.log(`მოგესალმებით ბატონო ${userFirstName}`)
//     }
// }else{
//     if(userIsFemale){
//         console.log(`დროებით ქალბატონო ${userFirstName}`);
//     }else{
//         console.log(`დროებით ბატონო ${userFirstName}`)

//     }
// }
 


console.log(`${userLoggedIn ? 'სალამი': 'დროებით'} ${userIsFemale ? 'ქალბატონო' : 'ბატონო'}`);


// ნაბიჯი 1: 
//     დალოგინებული იუზერი
//     იუზერის სახელი 
//     იუზერის სქესი
// ნაბიჯი 2: 
//      მივესალმო თუა არა იუზერის
// ნაბიჯი 3: 
//      თუ იუზერი დალოგინებული არ არის უნდა დავემშვიდობო
//      თუ იუზერი დალოგინებული მაშინ უნდა მივესალმო იუზერს 
// ნაბიჯი 4:
//      მარა ჯერ კოდი არ დამიწერია :D


 
     