// თქვენი დავალებაა შექმნათ ფუნქცია, რომელსაც გამოიძახებს პორტალი და ჩააწვდის 1 არგუმენტს:
// ფუნქციამ ჩაწოდებულ მასივში უნდა იპოვოს 2 რიცხვი, რომელთა ჯამიც უდრის 0-ს.
// ასეთის პოვნის შემთხვევაში დააბრუნოს - true
// თუ ასეთი წყვილი არ არის მასივში, დააბრუნოს - false

// P.S. შეგიძლიათ ჩათვალოთ რომ ჩამოწოდებულ მასივში რიცხვები ყოველთვის ზრდადობის მიხედვით იქნება დალაგებული.

const array = [-5, -4, -3, -1, 0, 1, 2, 3, 4];
   // 1. მოცემული მაქვს ერეი , როგორც დადბითი ასევე უარყოფითი რიცხვების, გადავირბინო ამ მასივზე და მივწვდე  სათთაო ელემნტს
        function sumZero(array) {
            let isZerro =  false;
            for(let i =0; i < array.length; i ++){
                for(let j = i + 1; j < array.length; j ++){
                        // 2. მასივში უნდა ვიპოვო 2 რიცხვი რომლის ჯამიც არის ნული. 
                    if(array[i] + array[j] == 0){
                        return true
                    }
                }
            }
            isZerro =  false
        }
 //3. ასეთის პოვნის სემთხვევაში უნდა დავაბრუნო ან თუ ან ფოლსი 
 console.log(sumZero(array));
 

 