const array = [1,1,2,3,3,3,3,4,4,5,5,5,6,6,6,6,7,7,7,7,7];
// თქვენი დავალებაა ფუნქციამ დათვალოს რამდენი უნიკალური რიცხვია მასივში და პასუხი დააბრუნოს რიცხვის სახით.

// spread-ის მეშვეობით ვიღებ უნიკალურ რიცხვ  არაიდან,  
            //  new Set  -  არის ჩაშენებული , რომელიც აკეთებს შედმეგ რაღაცაც , new -  ქმნის  ახალ უხილავ ობიექტს
            //      ხოლო Set -  ის მეშვეობით იხებს დუბლიკატებს და ინახავს new ობიექტში.
            // ხოლო სპრედის დახმარებით ვაბრუნებთ ახალ მასივ. 
 
// function countUnique(array) {
//     const uniqueArray = [...new Set(array)]; 
//     return uniqueArray.length
// }
// console.log(countUnique(array));
 
//  რა არის ჩემი ინფუთი ?? -  ჩემი ინფოთი არის მასივში არსებული ინფორმაცია
     
// რა უნდა  იყოს ჩემი აუთფუთი ? -  უნიკალური რიცხვი 

//ჩემი მიზანია ეს დავალება შევასრულო On -  ში

 
function countUnique(array)  {

    const count = {}   // შევქმენი ცალკე ობიექტი მასივისთვის სადაც   შევინახავ   
                       // და დავთვლი თუ რამდენი  სიმბოლო მაქვს 
     // ახლა გადავირბენ მაისვზე და მივწვდები მასივის  სათითაო ელემენტს. 
    for(let i = 0; i < array.length; i ++){
        // იფ ლოგიკით შევამოწმებ თუ ობიექტში რომელიც მე შევქმენი ეს ციფრი არსებობს  
        // და მე კიდევ სემხვდა იგივე ციფრი ამ სიფრს ვზრდი
        // თუ არადა ვქმნი ახალს. 
        if(count[`${array[i]}`]){
            count[`${array[i]}`]++
        }else{
            count[`${array[i]}`] = 1
        }
        // console.log(count);
        
    }
        // საბოლოოდ დავატრიალებ ახალ ფორ ინს და key -  ის მეშევეობით დავთვლის კის და გავ

    let counter = 0;
    // ფორ ინის key - ის მეშვეობით ამოვიღებ რამდენი უნიკალური რიცხვი მაქვს მასივში. 
    for(key in count){
        counter ++
    }

    return counter

}

 
 console.log(countUnique(array));
 

 



 