const message = 'გამარჯობა,';

// თქვენი ამოცანაა გადაირბინოთ სტრინგზე და დათვალოთ რამდენ ასო რ-ს, ასო ა-ს და (,) მძიმეს შეიცავს ის.
// პასუხი ჩაწერეთ ცვლადში:
let counts = [0 , 0, 0];

// სადაც:
// 1. 0 ინდექსზე არსებული ინფორმაცია წარმოადგენს ასო რ-ს რაოდენობას,
// 2. 1 ინდექსზე არსებული ინფორმაცია წარმოადგენს ასო ა-ს რაოდენობას,
// 3. 2 ინდექსზე წერია თუ რამდენ მძიმეს(,) შეიცავს სტრინგი.

// ნაბიჯი 1: მოცემული მაქვს message - ცვლადი სადაც შეტანილია სტრინგი. 
// ნაბიჯი 2 : გადავურბინმო  message  ცვლადში შეტანილ სტრინგს  და ყოველ იტარციაზე შვამოწმო მისი შიგთავსი. 
// ნაბიჯი 3 : დავწერო იფის პირობა რომელიც  შემაოწმებს   თუ სტრინგის რომელიმე ინდექსი ემთხვევა  საჭირო
// ასოს მაშინ დავუმატო ერთი ,  ეს უნდა გავიმეორო ყველა  იმ სიმბოლოზე რომლის დათვლაც მინდა  

for(let i = 0; i < message.length; i++){
     if(message[i] === 'რ'){
        counts[0] += 1;
     }else if(message[i] === 'ა'){
        counts[1] += 1
     }else if(message[i] === ','){
        counts [2] += 1
     }
}

console.log(counts);

 
