// Phone Login
// მოცემული გვაქვს ვებსაიტის მომხმარებლების მობილურის ნომრები array-ს სახით:

const userPhones = ['5XXXXXXXX', '5XXXXXXXX'];
// ვებსაიტზე შემოსვლას ცდილობს მომხმარებელი, მიუთითა ტელეფონის ნომერი:
const loginPhone = '5XXXXXXXX';
// შეამოწმეთ არის თუ არა მომხმარებელი დარეგისტრირებული ბაზაში და ჩაწერეთ boolean პასუხი ცვლადში:
let userLoggedIn = false

// ნაბიჯი 1 : მაქვს მასივი რომელშიც შეტანილია  მომხმარებლის ნომები; 

// ნაბიჯი 2 : დავწერო პირობა რომელიც შემაოწმებს მასივში არსებული რომელიმე ნომერი ხომ არ ემთხვევა loginPhone -  ნომერს. 
// ნაბიჯი 3 : თუ ემთხვევა მაშნ ბულიან  მნიშვნელობით გამოვიტანო 


// ფორ ლუპით გადავურბენ მასივს , და შემდოგ იფის მეშვეობით შევამოწმებ მასივში არსებული ნომერი
//  არის თუ არა იუზერის მიერ შეყვანილი ნომერი თუ კი მაშინ გამოიტანსოს თრუ თუა არა და ფოლსი

for(let i = 0; i < userPhones.length; i ++){
    if(userPhones[i] ===  loginPhone){
        userLoggedIn =  true
    } 
}

console.log(userLoggedIn);
